<script setup lang="ts">
import { InfoCard } from '@/components/InfoCard';
import { StepperWithTabs } from '@/components/StepperWithTabs';

const information = [
  {
    tab: 'Принцип работы',
    component: InfoCard,
    props: {
      title: ['Принцип работы'],
      description: [
        'Интеллектуальные приборы учета электроэнергии ТМ «Энергомера» позволяют выявлять обрыв фазных и нулевых проводов при помощи векторных измерений параметров сети и эффективного алгоритма обмена данными.',
        'Реализованный в счетчике протокол телемеханики МЭК 60870-5-104 по GSM каналу обеспечивает взаимодействие с диспетчерской системой SCADA, которая за счет анализа топологии сети и параметров совокупности ее узлов, локализует места повреждений сети и формирует команду телеуправления на УСПД для снятия опасного напряжения с поврежденного участка сети.'
      ]
    }
  },
  {
    tab: 'Сценарий применения',
    component: InfoCard,
    props: {
      title: ['Сценарий применения'],
      descriptionList: [
        'В распределительной устанавливаются приборы учета СЕ308',
        'В счетчиках выполняется настройка критериев выявления обрывов проводов, задаются параметры сервера телемеханики SCADA.',
        'В штатном режиме приборы учета работают как элементы коммерческого учета, передавая показания по протоколу СПОДЭС.',
        'При обрыве фазного или нулевого провода счетчик по протоколу МЭК 60870-5-104 направляет сообщение об аварийной ситуации в ПО SCADA.',
        'В SCADA проводится анализ поступающих сигналов от всех контрольных  счетчиков распределительной сети.',
        'Выявляется участок, на котором произошла аварийная ситуация.',
        'Информация отображается на мнемосхеме и карте местности.',
        'Подается команда телеуправления на УСПД, установленный в трансформаторной подстанции.',
        'Отключается поврежденный фидер или отпайка линии.',
        'Диспетчер направляет ремонтную бригаду для устранения неисправности к конкретному участку линии.'
      ]
    }
  },
  {
    tab: 'Особенности системы',
    component: InfoCard,
    props: {
      title: ['Особенности системы'],
      descriptionList: [
        'Минимальные затраты на реализацию функций защиты от обрывов проводов ВЛ за счет использования инфраструктуры ИСУЭ.',
        'Параллельная работа контрольных счетчиков по протоколу СПОДЭС с сервером ИСУЭ и по протоколу телемеханики МЭК 60870-5-104 с сервером SCADA.',
        'Возможность защиты от КЗ в конце линии (защитное оборудование на ТП обычно такие КЗ не выявляют и не отрабатывает).',
        'Возможность измерений на низкой стороне на основе обрывов проводов на стороне среднего напряжения.',
        'Локализация поврежденного участка линии на основе анализа информации с группы контрольных счетчиков в SCADA.',
        'Отображение информации на мнемосхеме и карте местности.',
        'Исключение необходимости отправки оперативной бригады на объект для обследования.'
      ]
    }
  }
]
</script>

<template>
  <div 
    class="power-supply-companies-mobile-app"
    data-aos="fade-in"
    :data-aos-duration="500"
  >
    <div 
      class="left-block"
    >
      <h2 class="title">Система защиты от обрыва фазных и нейтрального проводов ВЛ 0,4кВ</h2>
      <p class="description">
        Система базируется на ИСУЭ и позволяет выявлять аварийные ситуации на линиях 0,4кВ, сокращая риски, связанные с электро- и пожароопасным характером и сбоями в электроснабжении потребителей.
      </p>
      <img class="image" src="../../assets/images/phase-failure-system.png" alt="">
    </div>
    <div class="right-block">
      <StepperWithTabs :items="information" />
    </div>
  </div>
</template>

<style lang="scss" scoped>
.power-supply-companies-mobile-app {
  display: flex;
  justify-content: space-between
}
.left-block {
  position: relative;
}

.title {
  margin-top: 40px;
  @include title-h2;
}

.description {
  @include subtitle;
  margin-top: 20px;
  color: $color-dark-grey;
  max-width: 850px;
}

.image {
  margin-left: -20px;
  margin-top: 102px;
  position: static;
}
</style>